Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་སྐྱེ་བའི་ཚིག་བླ་དགས་སམ། འགག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of the ears, nose, tongue, body, and mental faculty as arising or ceasing constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of the eyes as entities or non-entities constitutes a bodhisattva?”

source: སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of the ears, nose, tongue, body, and mental faculty as entities or non-entities constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights constitutes a bodhisattva?”

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as permanent or impermanent constitutes a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སྒྲ་དང་།
en: “No, Reverend Lord!”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as permanent or impermanent constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་བདེ་བའི་ཚིག་བླ་དགས་སམ། སྡུག་བསྔལ་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as imbued with happiness or suffering constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་ཀྱི་བདེ་བའི་ཚིག་བླ་དགས་སམ། སྡུག་བསྔལ་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as imbued with happiness or suffering constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་བདག་ཡོད་པའི་ཚིག་བླ་དགས་སམ། བདག་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as a self or not a self constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་བདག་ཡོད་པའི་ཚིག་བླ་དགས་སམ། བདག་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as a self or not a self constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་སྟོང་པའི་ཚིག་བླ་དགས་སམ། མི་སྟོང་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as empty or not empty constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་སྟོང་པའི་ཚིག་བླ་དགས་སམ། མི་སྟོང་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as empty or not empty constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་མཚན་མ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། མཚན་མ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as with signs or signless constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་མཚན་མ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། མཚན་མ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as with signs or signless constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་སྨོན་པ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། སྨོན་པ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as having aspirations or lacking aspirations constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་སྨོན་པ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། སྨོན་པ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as having aspirations or lacking aspirations constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ།
en: “No, Reverend Lord!”

source: བམ་པོ་ལྔ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་ཞི་བའི་ཚིག་བླ་དགས་སམ། མ་ཞི་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as calm or not calm constitutes a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་དུ་སྒྲ་དང་།
en: “No, Reverend Lord!”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་ཞི་བའི་ཚིག་བླ་དགས་སམ། མ་ཞི་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as calm or not calm constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་དབེན་པའི་ཚིག་བླ་དགས་སམ། མི་དབེན་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as void or not void constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་དབེན་པའི་ཚིག་བླ་དགས་སམ། མི་དབེན་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as void or not void constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བླ་དགས་སམ། རྣམ་པར་བྱང་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as afflicted or purified constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བླ་དགས་སམ། རྣམ་པར་བྱང་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as afflicted or purified constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ།
en: “No, Reverend Lord!”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་སྐྱེ་བའི་ཚིག་བླ་དགས་སམ། འགག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as arising or ceasing constitutes a bodhisattva?”

source: དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་སྐྱེ་བའི་ཚིག་བླ་དགས་སམ། འགག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as arising or ceasing constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། གཟུགས་རྣམས་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of sights as entities or non-entities constitutes a bodhisattva?”

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་དང་། ཆོས་རྣམས་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of sounds, odors, tastes, tangibles, and mental phenomena as entities or non-entities constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designation of the sensory element of the eyes constitutes a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness constitute a bodhisattva?”

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “In the same vein, do you think that the designations [of all the remaining sensory elements], up to and including the sensory element of mental consciousness, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness as permanent or impermanent constitute a bodhisattva?”

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “In the same vein, do you think that the designations [of all the remaining sensory elements], up to and including the sensory element of mental consciousness as permanent or impermanent, constitute a bodhisattva?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་མ་ལགས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་།
en: “No, Reverend Lord!”

source: གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་བདེ་བའི་ཚིག་བླ་དགས་སམ། སྡུག་བསྔལ་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as imbued with happiness or suffering, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་བདག་ཡོད་པའི་ཚིག་བླ་དགས་སམ། བདག་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as a self or not a self, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་སྟོང་པའི་ཚིག་བླ་དགས་སམ། མི་སྟོང་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as empty or not empty, constitute a bodhisattva?”

source: གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་མཚན་མ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། མཚན་མ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as with signs or signless, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་སྨོན་པ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། སྨོན་པ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as having aspirations or lacking aspirations, constitute a bodhisattva?”

source: མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་ཞི་བའི་ཚིག་བླ་དགས་སམ། མ་ཞི་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as calm or not calm, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་དབེན་པའི་ཚིག་བླ་དགས་སམ། མི་དབེན་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as void or not void, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བླ་དགས་སམ། རྣམ་པར་བྱང་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as afflicted or purified, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་སྐྱེ་བའི་ཚིག་བླ་དགས་སམ། མི་སྐྱེ་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as arising or non-arising, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱི་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of [all the sensory elements], starting from the sensory element of the eyes, the sensory element of sights, and the sensory element of visual consciousness, and continuing in the same vein as far as [the designation of] the sensory element of mental consciousness, as entities or non-entities, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as permanent or impermanent, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་བདེ་བའི་ཚིག་བླ་དགས་སམ། སྡུག་བསྔལ་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as imbued with happiness or suffering, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་བདག་ཡོད་པའི་ཚིག་བླ་དགས་སམ། བདག་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as a self or a non-self, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་སྟོང་པའི་ཚིག་བླ་དགས་སམ། མི་སྟོང་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as empty or not empty, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་མཚན་མ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། མཚན་མ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as with signs or signless, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་སྨོན་པ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། སྨོན་པ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as having aspirations or lacking aspirations, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་ཞི་བའི་ཚིག་བླ་དགས་སམ། མ་ཞི་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as calm or not calm, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་དབེན་པའི་ཚིག་བླ་དགས་སམ། མི་དབེན་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as void or not void, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བླ་དགས་སམ། རྣམ་པར་བྱང་བའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as afflicted or purified, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་སྐྱེ་བའི་ཚིག་བླ་དགས་སམ། འགག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as arising or ceasing, constitute a bodhisattva?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། མ་རིག་པ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། རྒ་ཤིའི་བར་གྱི་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་སམ། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་སྙམ་འམ།
en: “Śāradvatī­putra, do you think that the designations of fundamental ignorance and, in the same vein, of [all the other links of dependent origination], up to and including aging and death, as entities or non-entities, constitute a bodhisattva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་དོན་གྱི་དབང་ཅི་ཞིག་མཐོང་ན། འདི་སྐད་དུ་གཟུགས་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན།
en: Then, the Blessed One addressed the venerable Śāradvatī­putra in the following words: “Śāradvatī­putra, why do you say that the designation of physical forms does not constitute a bodhisattva, and similarly, that the designations of feelings, perceptions, formative predispositions, and consciousness do not constitute a bodhisattva?

source: གཟུགས་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་རྟག་པའི་ཚིག་བླ་དགས་སམ། མི་རྟག་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན།
en: Why do you say that the designation of physical forms as permanent or impermanent does not constitute a bodhisattva?

source: དེ་བཞིན་དུ་གཟུགས་བདེ་བའི་ཚིག་བླ་དགས་མ་ཡིན། སྡུག་བསྔལ་བའི་ཚིག་བླ་དགས་མ་ཡིན། བདག་ཡོད་པའི་ཚིག་བླ་དགས་མ་ཡིན། བདག་མེད་པའི་ཚིག་བླ་དགས་མ་ཡིན། སྟོང་པའི་ཚིག་བླ་དགས་མ་ཡིན། མི་སྟོང་པའི་ཚིག་བླ་དགས་མ་ཡིན། མཚན་མ་ཡོད་པའི་ཚིག་བླ་དགས་མ་ཡིན། མཚན་མ་མེད་པའི་ཚིག་བླ་དགས་མ་ཡིན། སྨོན་པ་ཡོད་པའི་ཚིག་བླ་དགས་མ་ཡིན། སྨོན་པ་མེད་པའི་ཚིག་བླ་དགས་མ་ཡིན། ཞི་བའི་ཚིག་བླ་དགས་མ་ཡིན། མ་ཞི་བའི་ཚིག་བླ་དགས་མ་ཡིན། དབེན་པའི་ཚིག་བླ་དགས་མ་ཡིན། མི་དབེན་པའི་ཚིག་བླ་དགས་མ་ཡིན། ཀུན་ནས་ཉོན་མོངས་པའི་ཚིག་བླ་དགས་མ་ཡིན། རྣམ་པར་བྱང་བའི་ཚིག་བླ་དགས་མ་ཡིན། སྐྱེ་བའི་ཚིག་བླ་དགས་མ་ཡིན། འགག་པའི་ཚིག་བླ་དགས་མ་ཡིན། དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་མ་ཡིན། དངོས་པོ་མེད་པའི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Similarly, why do you say that the designation of physical forms as imbued with happiness or suffering, their designation as a self or not a self, their designation as empty or not empty, their designation as with signs or signless, their designation as having aspirations or lacking aspirations, their designation as calm or not calm, their designation as void or not void, their designation as afflicted or purified, their designation as arising or ceasing, and their designation as entities or non-entities [do not constitute a bodhisattva]?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དངོས་པོ་ཡོད་པའི་ཚིག་བླ་དགས་དང་། དངོས་པོ་མེད་པའི་བར་གྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན།
en: In the same vein, why do you say that these same designations, made with respect to feelings, perceptions, formative predispositions, and consciousness, up to and including their designation as entities or non-entities, do not constitute a bodhisattva?

source: དེ་བཞིན་དུ་མིག་གི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་ཚིག་བླ་དགས་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན།
en: “In like manner, why do you say that the designation of the eyes does not constitute a bodhisattva, and similarly, that the designations of the ears, the nose, the tongue, the body, and the mental faculty do not constitute a bodhisattva?
